sessions/R13-slotted-counter/results/hotspot/slot64-r1.k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/beomsu/Desktop/incident-lab/sessions/R13-slotted-counter/scripts/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m10s max duration (incl. graceful stop):
              * sponsor: 100 looping VUs for 1m0s (gracefulStop: 10s)

time="2026-07-28T20:58:48+09:00" level=info msg="[분포] 시나리오=hotspot 방송=1000 s=1.2 | 1위 방송 23.1% · 상위10 56.9% · 상위1% 56.9%" source=console

running (0m01.0s), 100/100 VUs, 3576 complete and 0 interrupted iterations
sponsor   [   2% ] 100 VUs  0m01.0s/1m0s

running (0m02.0s), 100/100 VUs, 7501 complete and 0 interrupted iterations
sponsor   [   3% ] 100 VUs  0m02.0s/1m0s

running (0m03.0s), 100/100 VUs, 11513 complete and 0 interrupted iterations
sponsor   [   5% ] 100 VUs  0m03.0s/1m0s

running (0m04.0s), 100/100 VUs, 15489 complete and 0 interrupted iterations
sponsor   [   7% ] 100 VUs  0m04.0s/1m0s

running (0m05.0s), 100/100 VUs, 19544 complete and 0 interrupted iterations
sponsor   [   8% ] 100 VUs  0m05.0s/1m0s

running (0m06.0s), 100/100 VUs, 23421 complete and 0 interrupted iterations
sponsor   [  10% ] 100 VUs  0m06.0s/1m0s

running (0m07.0s), 100/100 VUs, 27390 complete and 0 interrupted iterations
sponsor   [  12% ] 100 VUs  0m07.0s/1m0s

running (0m08.0s), 100/100 VUs, 31403 complete and 0 interrupted iterations
sponsor   [  13% ] 100 VUs  0m08.0s/1m0s

running (0m09.0s), 100/100 VUs, 35365 complete and 0 interrupted iterations
sponsor   [  15% ] 100 VUs  0m09.0s/1m0s

running (0m10.0s), 100/100 VUs, 39316 complete and 0 interrupted iterations
sponsor   [  17% ] 100 VUs  0m10.0s/1m0s

running (0m11.0s), 100/100 VUs, 43308 complete and 0 interrupted iterations
sponsor   [  18% ] 100 VUs  0m11.0s/1m0s

running (0m12.0s), 100/100 VUs, 47428 complete and 0 interrupted iterations
sponsor   [  20% ] 100 VUs  0m12.0s/1m0s

running (0m13.0s), 100/100 VUs, 51572 complete and 0 interrupted iterations
sponsor   [  22% ] 100 VUs  0m13.0s/1m0s

running (0m14.0s), 100/100 VUs, 55618 complete and 0 interrupted iterations
sponsor   [  23% ] 100 VUs  0m14.0s/1m0s

running (0m15.0s), 100/100 VUs, 59729 complete and 0 interrupted iterations
sponsor   [  25% ] 100 VUs  0m15.0s/1m0s

running (0m16.0s), 100/100 VUs, 63798 complete and 0 interrupted iterations
sponsor   [  27% ] 100 VUs  0m16.0s/1m0s

running (0m17.0s), 100/100 VUs, 67702 complete and 0 interrupted iterations
sponsor   [  28% ] 100 VUs  0m17.0s/1m0s

running (0m18.0s), 100/100 VUs, 71577 complete and 0 interrupted iterations
sponsor   [  30% ] 100 VUs  0m18.0s/1m0s

running (0m19.0s), 100/100 VUs, 75586 complete and 0 interrupted iterations
sponsor   [  32% ] 100 VUs  0m19.0s/1m0s

running (0m20.0s), 100/100 VUs, 79408 complete and 0 interrupted iterations
sponsor   [  33% ] 100 VUs  0m20.0s/1m0s

running (0m21.0s), 100/100 VUs, 83311 complete and 0 interrupted iterations
sponsor   [  35% ] 100 VUs  0m21.0s/1m0s

running (0m22.0s), 100/100 VUs, 87313 complete and 0 interrupted iterations
sponsor   [  37% ] 100 VUs  0m22.0s/1m0s

running (0m23.0s), 100/100 VUs, 91227 complete and 0 interrupted iterations
sponsor   [  38% ] 100 VUs  0m23.0s/1m0s

running (0m24.0s), 100/100 VUs, 95456 complete and 0 interrupted iterations
sponsor   [  40% ] 100 VUs  0m24.0s/1m0s

running (0m25.0s), 100/100 VUs, 99661 complete and 0 interrupted iterations
sponsor   [  42% ] 100 VUs  0m25.0s/1m0s

running (0m26.0s), 100/100 VUs, 103599 complete and 0 interrupted iterations
sponsor   [  43% ] 100 VUs  0m26.0s/1m0s

running (0m27.0s), 100/100 VUs, 107886 complete and 0 interrupted iterations
sponsor   [  45% ] 100 VUs  0m27.0s/1m0s

running (0m28.0s), 100/100 VUs, 111931 complete and 0 interrupted iterations
sponsor   [  47% ] 100 VUs  0m28.0s/1m0s

running (0m29.0s), 100/100 VUs, 115669 complete and 0 interrupted iterations
sponsor   [  48% ] 100 VUs  0m29.0s/1m0s

running (0m30.0s), 100/100 VUs, 119475 complete and 0 interrupted iterations
sponsor   [  50% ] 100 VUs  0m30.0s/1m0s

running (0m31.0s), 100/100 VUs, 123310 complete and 0 interrupted iterations
sponsor   [  52% ] 100 VUs  0m31.0s/1m0s

running (0m32.0s), 100/100 VUs, 127226 complete and 0 interrupted iterations
sponsor   [  53% ] 100 VUs  0m32.0s/1m0s

running (0m33.0s), 100/100 VUs, 131486 complete and 0 interrupted iterations
sponsor   [  55% ] 100 VUs  0m33.0s/1m0s

running (0m34.0s), 100/100 VUs, 135621 complete and 0 interrupted iterations
sponsor   [  57% ] 100 VUs  0m34.0s/1m0s

running (0m35.0s), 100/100 VUs, 139590 complete and 0 interrupted iterations
sponsor   [  58% ] 100 VUs  0m35.0s/1m0s

running (0m36.0s), 100/100 VUs, 143781 complete and 0 interrupted iterations
sponsor   [  60% ] 100 VUs  0m36.0s/1m0s

running (0m37.0s), 100/100 VUs, 147828 complete and 0 interrupted iterations
sponsor   [  62% ] 100 VUs  0m37.0s/1m0s

running (0m38.0s), 100/100 VUs, 151816 complete and 0 interrupted iterations
sponsor   [  63% ] 100 VUs  0m38.0s/1m0s

running (0m39.0s), 100/100 VUs, 155951 complete and 0 interrupted iterations
sponsor   [  65% ] 100 VUs  0m39.0s/1m0s

running (0m40.0s), 100/100 VUs, 160043 complete and 0 interrupted iterations
sponsor   [  67% ] 100 VUs  0m40.0s/1m0s

running (0m41.0s), 100/100 VUs, 164122 complete and 0 interrupted iterations
sponsor   [  68% ] 100 VUs  0m41.0s/1m0s

running (0m42.0s), 100/100 VUs, 168195 complete and 0 interrupted iterations
sponsor   [  70% ] 100 VUs  0m42.0s/1m0s

running (0m43.0s), 100/100 VUs, 172178 complete and 0 interrupted iterations
sponsor   [  72% ] 100 VUs  0m43.0s/1m0s

running (0m44.0s), 100/100 VUs, 175811 complete and 0 interrupted iterations
sponsor   [  73% ] 100 VUs  0m44.0s/1m0s

running (0m45.0s), 100/100 VUs, 179993 complete and 0 interrupted iterations
sponsor   [  75% ] 100 VUs  0m45.0s/1m0s

running (0m46.0s), 100/100 VUs, 184121 complete and 0 interrupted iterations
sponsor   [  77% ] 100 VUs  0m46.0s/1m0s

running (0m47.0s), 100/100 VUs, 188144 complete and 0 interrupted iterations
sponsor   [  78% ] 100 VUs  0m47.0s/1m0s

running (0m48.0s), 100/100 VUs, 192258 complete and 0 interrupted iterations
sponsor   [  80% ] 100 VUs  0m48.0s/1m0s

running (0m49.0s), 100/100 VUs, 196477 complete and 0 interrupted iterations
sponsor   [  82% ] 100 VUs  0m49.0s/1m0s

running (0m50.0s), 100/100 VUs, 200321 complete and 0 interrupted iterations
sponsor   [  83% ] 100 VUs  0m50.0s/1m0s

running (0m51.0s), 100/100 VUs, 204320 complete and 0 interrupted iterations
sponsor   [  85% ] 100 VUs  0m51.0s/1m0s

running (0m52.0s), 100/100 VUs, 208314 complete and 0 interrupted iterations
sponsor   [  87% ] 100 VUs  0m52.0s/1m0s

running (0m53.0s), 100/100 VUs, 212086 complete and 0 interrupted iterations
sponsor   [  88% ] 100 VUs  0m53.0s/1m0s

running (0m54.0s), 100/100 VUs, 216034 complete and 0 interrupted iterations
sponsor   [  90% ] 100 VUs  0m54.0s/1m0s

running (0m55.0s), 100/100 VUs, 220138 complete and 0 interrupted iterations
sponsor   [  92% ] 100 VUs  0m55.0s/1m0s

running (0m56.0s), 100/100 VUs, 223924 complete and 0 interrupted iterations
sponsor   [  93% ] 100 VUs  0m56.0s/1m0s

running (0m57.0s), 100/100 VUs, 228116 complete and 0 interrupted iterations
sponsor   [  95% ] 100 VUs  0m57.0s/1m0s

running (0m58.0s), 100/100 VUs, 232299 complete and 0 interrupted iterations
sponsor   [  97% ] 100 VUs  0m58.0s/1m0s

running (0m59.0s), 100/100 VUs, 236357 complete and 0 interrupted iterations
sponsor   [  98% ] 100 VUs  0m59.0s/1m0s

running (1m00.0s), 100/100 VUs, 240518 complete and 0 interrupted iterations
sponsor   [ 100% ] 100 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<1' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 240714  4010.551051/s
    checks_succeeded...: 100.00% 240714 out of 240714
    checks_failed......: 0.00%   0 out of 240714

    ✓ status 200

    CUSTOM
    sponsor_latency................: avg=24.86ms min=7.87ms med=23.52ms p(95)=37.57ms p(99)=47.34ms max=105.49ms

    HTTP
    http_req_duration..............: avg=24.86ms min=7.87ms med=23.52ms p(95)=37.57ms p(99)=47.34ms max=105.49ms
      { expected_response:true }...: avg=24.86ms min=7.87ms med=23.52ms p(95)=37.57ms p(99)=47.34ms max=105.49ms
    http_req_failed................: 0.00%  0 out of 240714
    http_reqs......................: 240714 4010.551051/s

    EXECUTION
    iteration_duration.............: avg=24.92ms min=7.91ms med=23.58ms p(95)=37.63ms p(99)=47.4ms  max=105.53ms
    iterations.....................: 240714 4010.551051/s
    vus............................: 100    min=100         max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 18 MB  294 kB/s
    data_sent......................: 41 MB  686 kB/s



running (1m00.0s), 000/100 VUs, 240714 complete and 0 interrupted iterations
sponsor ✓ [ 100% ] 100 VUs  1m0s